Revit 2026 API

# ElectricalSystemRunsNumber Property

---

The Runs Number of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int RunsNumber { get; }
```
```vb
Public ReadOnly Property RunsNumber As Integer
	Get
```
```cpp
public:
property int RunsNumber {
	int get ();
}
```
```fsharp
member RunsNumber : int with get
```

#### Property Value

Int32

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This property only available when System Type is Power! |

This property is used to retrieve the Runs Number of the Electrical System.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace